./scriptname.sh - запуск на выполение скрипта из текущей директори
#!/bin/sh - шебанг

if [[ условие ]]
then
    # действие
fi

if [[ условие ]]
then
    #
else
    #
fi

if [[ ]]
then
    #
elif
then
    #
else
    #
fi

case var in
value1)
    #
    ;;
value2)
    #
    ;;
*)
    #
    #
esac

Условия (строки):
-z <строка> # строка пуста
-n <строка> # строка не пуста
<стр1> == <стр2> # строки равны
<стр1> != <стр2> # строки не равны

сравнение чисел (строк)
-eq (==) равно
-ne (!=) не равно
-lt (<) меньше
-le (<=) меньше или равно
-gt (>) больше
-ge (>=) больше или равно 

файлы 
-e <путь> # путь существует
-f <путь> # это файл
-d <путь> # это директория
-s <путь> # размер файла больше 0
-x <путь> # файл исполняемый

условия
! # отрицание
&& # И
|| # ИЛИ

